#ifndef AD_PLAYER_H_
#define AD_PLAYER_H_

#include "ui_context.h"

/**************************************************************************
 *
 *   @brief : 启动广告播放线程
 *   @arg   : ui  指向 ui_context_t 结构体的指针
 *
 *   @retval: 成功返回 0，失败返回 -1
 *   @note  : 在主菜单显示时调用
 *
 ***************************************************************************/
int start_ad_player(ui_context_t *ui);

/**************************************************************************
 *
 *   @brief : 停止广告播放线程
 *   @arg   : ui  指向 ui_context_t 结构体的指针
 *
 *   @retval: 成功返回 0，失败返回 -1
 *   @note  : 在用户选择后调用，等待线程结束并回收资源
 *
 ***************************************************************************/
int stop_ad_player(ui_context_t *ui);

#endif